Revit 2021.1 API
AlignmentStationLabelOptions.Station Property
 Specifies the station at which the label will be placed. The station determines the location of the label's origin: Origin by setting it to the closest point on the alignment geometry which corresponds to this station.
Namespace: Autodesk.Revit.DB.Infrastructure
Assembly: Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 21.0.0.0 (21.1.1.109)
Since: 2021.1
Syntax
C#
public double Station { get; set; }
Visual Basic
Public Property Station As Double
	Get
	Set
Visual C++
public:
property double Station {
	double get ();
	void set (double value);
}
See Also
AlignmentStationLabelOptions Class
Autodesk.Revit.DB.Infrastructure Namespace